# Packages
brew 'ack'
brew 'tree'
brew 'wget'
brew 'vim'
brew 'git'
brew 'hub'
brew 'tmux'
brew 'zsh'
brew 'nvm'
brew 'markdown'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'awscli'
brew 'watch'
brew 'reattach-to-user-namespace'
brew 'lastpass-cli'
brew 'httpie'
brew 'kubectl'
brew 'kubernetes-helm'
brew 'jq'
brew 'wifi-password'
brew 'bat'
brew 'ripgrep'

# Casks
cask_args appdir: '/Applications'
tap 'caskroom/cask'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'google-chrome'
cask 'iterm2'
cask 'virtualbox'
cask 'spotify'
cask 'spectacle'
cask 'alfred'
cask 'visual-studio-code'
cask 'postman'
cask 'slack'
cask 'robo-3t'

# Font
tap caskroom/fonts
cask 'font-fira-code'

# App Store Apps
brew 'mas'
mas 'lastpass', id: 926036361
mas 'Evernote', id: 406056744
mas 'iA Writer', id: 775737590
mas 'Xcode', id: 497799835
mas 'Wunderlist', id: 410628904
mas 'Slack', id: 803453959
mas 'Dash', id: 449589707
mas '1Password', id: 1333542190
